In [1]:
#Importing the important libraries 
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns
%matplotlib inline 
plt.rcParams['figure.figsize'] = (16,10)
from pandas import DataFrame
import datetime as dt

In [2]:
#Importing the data
data_train = pd.read_csv('train.csv')
data_test = pd.read_csv('test.csv')

In [3]:
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [4]:
data_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
data_train.shape

(891, 12)

In [6]:
#Treating the null values

In [7]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [8]:
data_train = data_train.drop(('Cabin'),axis=1)

In [9]:
data_train.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,C

In [10]:
data_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [11]:
data_train = data_train.drop(('Name'),axis=1)
data_train = data_train.drop(('Ticket'),axis=1)
data_train = data_train.drop(('Fare'),axis=1)

In [12]:
data_train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0            1         0       3    male  22.0      1      0        S
1            2         1       1  female  38.0      1      0        C
2            3         1       3  female  26.0      0      0        S
3            4         1       1  female  35.0      1      0        S
4            5         0       3    male  35.0      0      0        S

In [13]:
data_train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Embarked         2
dtype: int64

In [14]:
data_train.Age.mean()

29.69911764705882

In [15]:
data_train.Age = data_train.Age.fillna(data_train.Age.mean())

In [16]:
data_train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Embarked       2
dtype: int64

In [17]:
data_train.dropna(inplace=True)

In [18]:
data_train.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0            1         0       3    male  22.0      1      0        S
1            2         1       1  female  38.0      1      0        C
2            3         1       3  female  26.0      0      0        S
3            4         1       1  female  35.0      1      0        S
4            5         0       3    male  35.0      0      0        S

In [19]:
data_train.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Embarked       0
dtype: int64

In [20]:
data_train.Parch.value_counts()

0    676
1    118
2     80
3      5
5      5
4      4
6      1
Name: Parch, dtype: int64

In [21]:
data_train.SibSp.value_counts()

0    606
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [22]:
data_train = data_train.drop(('Parch'),axis=1)
data_train = data_train.drop(('SibSp'),axis=1)

In [23]:
data_train.head(10)

   PassengerId  Survived  Pclass     Sex        Age Embarked
0            1         0       3    male  22.000000        S
1            2         1       1  female  38.000000        C
2            3         1       3  female  26.000000        S
3            4         1       1  female  35.000000        S
4            5         0       3    male  35.000000        S
5            6         0       3    male  29.699118        Q
6            7         0       1    male  54.000000        S
7            8         0       3    male   2.000000        S
8            9         1       3  female  27.000000        S
9           10         1       2  female  14.000000        C

In [24]:
# Data Encoding 
from sklearn.preprocessing import LabelEncoder
LabelEncoder = LabelEncoder()

In [25]:
data_train.Sex = LabelEncoder.fit_transform(data_train.Sex)
data_train.Embarked = LabelEncoder.fit_transform(data_train.Embarked)

In [26]:
data_train.head(10)

   PassengerId  Survived  Pclass  Sex        Age  Embarked
0            1         0       3    1  22.000000         2
1            2         1       1    0  38.000000         0
2            3         1       3    0  26.000000         2
3            4         1       1    0  35.000000         2
4            5         0       3    1  35.000000         2
5            6         0       3    1  29.699118         1
6            7         0       1    1  54.000000         2
7            8         0       3    1   2.000000         2
8            9         1       3    0  27.000000         2
9           10         1       2    0  14.000000         0

In [27]:
#Spliting the data into X and Y 
X = data_train.drop(('Survived'),axis=1)
Y = data_train['Survived'].values

In [28]:
from sklearn.model_selection import train_test_split
X_train ,X_valid , Y_train ,Y_valid = train_test_split(X,Y,test_size=0.2,random_state=0)

In [29]:
from sklearn.preprocessing import StandardScaler
Std = StandardScaler()
X_train = Std.fit_transform(X_train)
X_valid = Std.transform(X_valid)

In [30]:
#Modelling the data and fitting the data into Machine Learning Algorithms
def model(X_train,Y_train):
    #Logistic Regression 
    from sklearn.linear_model import LogisticRegression
    Log = LogisticRegression(random_state=0)
    Log.fit(X_train,Y_train)
    
    
    #SGD Classification 
    from sklearn.linear_model import SGDClassifier
    SGD = SGDClassifier(random_state=0)
    SGD.fit(X_train,Y_train)
    
    
    #Decision Tree Classification 
    from sklearn.tree import DecisionTreeClassifier
    tree = DecisionTreeClassifier(random_state=0)
    tree.fit(X_train,Y_train)
    
    
    #Random Forest Classification
    from sklearn.ensemble import RandomForestClassifier
    Forest = RandomForestClassifier(random_state=0)
    Forest.fit(X_train,Y_train)
    
    
    #Ada boost Classifiers
    from sklearn.ensemble import AdaBoostClassifier
    Ada = AdaBoostClassifier(random_state=0)
    Ada.fit(X_train,Y_train)
    
    
    #Support Vector Machine Classification
    from sklearn.svm import SVC
    SVM = SVC(random_state=0)
    SVM.fit(X_train,Y_train)
    
    #K nearest neighbou Classification
    from sklearn.neighbors import KNeighborsClassifier
    Knn = KNeighborsClassifier(n_neighbors=5)
    Knn.fit(X_train,Y_train)
    
    
    
    #Printing the Classifiers name and they R2 Score
    print('[0] Logistic Regression ',Log.score(X_train,Y_train))
    print('[1] SGD Classification ' ,SGD.score(X_train,Y_train))
    print('[2] Decision Tree Classification ',tree.score(X_train,Y_train))
    print('[3] Random Forest Classification',Forest.score(X_train,Y_train))
    print('[4] Ada Boost Classification ',Ada.score(X_train,Y_train))
    print('[5] Support Vector machine Classification ',SVM.score(X_train,Y_train))
    print('[6] K Nearest Neighbour Classification ',Knn.score(X_train,Y_train))
    
    
    return Log , SGD , tree , Forest , Ada , SVM , Knn

In [31]:
Models = model(X_train,Y_train)

[0] Logistic Regression  0.8129395218002813
[1] SGD Classification  0.7580872011251758
[2] Decision Tree Classification  1.0
[3] Random Forest Classification 1.0
[4] Ada Boost Classification  0.8481012658227848
[5] Support Vector machine Classification  0.8452883263009845
[6] K Nearest Neighbour Classification  0.8565400843881856

In [32]:
# Lets clean and process the X_test data
data_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [33]:
data_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Sex', 'Age', 'Embarked'], dtype='object')

In [34]:
data_test = data_test.drop(('Name'),axis=1)
data_test = data_test.drop(('SibSp'),axis=1)
data_test = data_test.drop(('Parch'),axis=1)
data_test = data_test.drop(('Ticket'),axis=1)
data_test = data_test.drop(('Fare'),axis=1)
data_test.head(10)
data_test.columns

Index(['PassengerId', 'Pclass', 'Sex', 'Age', 'Cabin', 'Embarked'], dtype='object')

In [35]:
data_test = data_test.drop(('Cabin'),axis=1)

In [36]:
data_test.head(10)

   PassengerId  Pclass     Sex   Age Embarked
0          892       3    male  34.5        Q
1          893       3  female  47.0        S
2          894       2    male  62.0        Q
3          895       3    male  27.0        S
4          896       3  female  22.0        S
5          897       3    male  14.0        S
6          898       3  female  30.0        Q
7          899       2    male  26.0        S
8          900       3  female  18.0        C
9          901       3    male  21.0        S

In [37]:
data_test.isnull().sum()

PassengerId     0
Pclass          0
Sex             0
Age            86
Embarked        0
dtype: int64

In [38]:
data_test.Age.mean()

30.272590361445783

In [39]:
data_test.Age.fillna(data_test.Age.mean(),inplace=True)

In [40]:
data_test.isnull().sum()

PassengerId    0
Pclass         0
Sex            0
Age            0
Embarked       0
dtype: int64

In [41]:
X_test = data_test

In [42]:
X_test.Sex = LabelEncoder.fit_transform(X_test.Sex)

In [43]:
X_test.Embarked = LabelEncoder.fit_transform(X_test.Embarked)

In [44]:
X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Sex          418 non-null    int32
 3   Age          418 non-null    float64
 4   Embarked     418 non-null    int32
dtypes: float64(1), int32(2), int64(2)
memory usage: 13.2 KB

In [45]:
from sklearn.preprocessing import StandardScaler
st = StandardScaler()
X_test = st.fit_transform(X_test)

In [46]:
Y_prediction = Models[3].predict(X_test)

In [47]:
Y_valid_prediction = Models[3].predict(X_train)

In [48]:
from sklearn.metrics import accuracy_score
print(accuracy_score(Y_train,Y_valid_prediction))

1.0

In [65]:
X_valid_prediction= Models[3].predict(X_valid)

In [66]:
from sklearn.metrics import accuracy_score
print(accuracy_score(Y_train,Y_valid_prediction))

ValueError: Found input variables with inconsistent numbers of samples: [711, 178]

In [67]:
from sklearn.metrics import accuracy_score
print(accuracy_score(Y_valid,X_valid_prediction))

0.7191011235955056

In [49]:
Submit = pd.read_csv('gender_submission.csv')

In [50]:
Submit

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [51]:
Submit['Survived'] = Y_prediction

In [52]:
X

     PassengerId  Pclass  Sex        Age  Embarked
0              1       3    1  22.000000         2
1              2       1    0  38.000000         0
2              3       3    0  26.000000         2
3              4       1    0  35.000000         2
4              5       3    1  35.000000         2
..           ...     ...  ...        ...       ...
886          887       2    1  27.000000         2
887          888       1    0  19.000000         2
888          889       3    0  29.699118         2
889          890       1    1  26.000000         0
890          891       3    1  32.000000         1

[889 rows x 5 columns]

In [53]:
Submit.to_csv('Titanic__2.csv',index=False)

In [54]:
mu= [[5,3,0,30,0]]

In [55]:
Std.transform(mu)

array([[-1.69035464,  0.819235  , -1.36213864,  0.03786839, -1.91124826]])

In [56]:
Models[3].predict(mu)

array([0], dtype=int64)

In [57]:
Submit

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]